package ir.theartofliving.honarezendegi.Model;


public class Post
{

    /**
     * id : 7402
     * date : 2016-11-16T22:00:31
     * link : http://www.wiadevelopers.com/2016/11/16/7402/
     * title : {"rendered":"گوگل وفیسبوک به جنگ سایت های دروغین می روند"}
     * content : {"rendered":"<div class=\"article-section\">\n<p>گوگل وفیسبوک به جنگ سایت های دروغین می روند با جلوگیری از نمایش تبلیغات آن<\/p>\n<p>&nbsp;<\/p>\n<p>گوگل و فیس\u200cبوک دیروز اعلام کردند که با تغییر استراتژی\u200cهای خود در پی قطع درآمدزایی وب\u200cسایت\u200cهایی هستند که از طریق انتشار اخبار جعلی اقدام به جلب نظر بینندگان و افزایش بازدیدکنندگان خود می\u200cکنند. این دو غول اینترنتی در نظر دارند با مسدود کردن استفاده از سرویس\u200cهای تبلیغاتی به این گونه وب\u200cسایت\u200cها، درآمد آن\u200cها را کاهش دهند.<\/p>\n<p>&nbsp;<\/p>\n<p>گوگل اعلام کرده که سیاست\u200cهای خود را به گونه\u200cای تغییر می\u200cدهد تا وب\u200cسایت\u200cهای منتشرکننده\u200cی محتوای جعلی قادر به استفاده از سرویس تبلیغاتی AdSense این کمپانی نباشند. همچنین فیس\u200cبوک با به\u200cروزرسانی استراتژی\u200cهای تبلیغاتی خود جلوی انتشار محتوای گمراه\u200cکننده را -که نتیجه\u200cای جز همه\u200cگیر شدن اخبار جعلی ندارد- می\u200cگیرد.<\/p>\n<p>تغییرات اعمال\u200cشده در سیاست\u200cهای گوگل و فیس\u200cبوک را باید تحت تأثیر اتهاماتی خواند که به این دو کمپانی (در کنار توییتر) برای عدم مدیریت اخبار جعلی وارد شده است. در جریان انتخابات ریاست جمهوری آمریکا که طی آن <em><strong>دونالد ترامپ<\/strong><\/em>، نامزد حذب جمهوری\u200cخواه به کاخ سفید رسید، هجمه\u200cی اخبار جعلی و دروغین منتشرشده علیه این نامزد باعث شد تا طرفداران وی، شبکه\u200cهای اجتماعی و گوگل را به دلیل عدم جلوگیری از نشر اطلاعات دروغین مورد انتقاد قرار دهند.<!--more--><\/p>\n<p>اتهامات واردشده واکنش\u200cهای بسیاری از سوی این کمپانی\u200cها برای شفاف\u200cسازی در مورد عدم جانب\u200cداری از کاندیداها در پی داشته است، به\u200cطوری\u200cکه <em><strong>مارک زاکربرگ<\/strong><\/em>، مؤسس و مدیرعامل فیس\u200cبوک در روزهای اخیر دو بار به این نکته اشاره کرده که سرویس تحت امرش هیچ تأثیری در روند برگزاری انتخابات نداشته است.<\/p>\n<p>تغییراتی که فیس\u200cبوک اعمال می\u200cکند، محدود به سیاست\u200cهای تبلیغاتی خود است و وب\u200cسایت\u200cهایی که اخبار آن\u200cها در فیس\u200cبوک توسط کاربران منتشر می\u200cشود از این موضوع تأثیر نخواهند پذیرفت.<\/p>\n<p>تغییر استراتژی گوگل نیز در نمایش لینک\u200cهای حاوی محتوای جعلی از قبیل اخبار در نتایج جستجو تأثیری نخواهد داشت. همچنین گوگل سیستمی برای رتبه\u200cبندی سایت\u200cها بر اساس صلاحیت خبر در پیش نخواهد گرفت؛ بلکه در پی آن است تا درآمدزایی وب\u200cسایت\u200cها از طریق انتشار اخبار نادرست و جعلی را که افزایش بازدید و افزایش درآمد تبلیغاتی در پی دارد، محدود کند. گوگل در این خصوص می\u200cگوید:<\/p>\n<blockquote><p>ما به\u200cمرور ارائه\u200cی سرویس تبلیغاتی خود را به صفحاتی از وب که حاوی محتوای جعلی، گمراه\u200cکننده یا نادرست باشند، محدود کرده یا اطلاعات مربوط به ناشر، محتوای موردنظر  یا هر  نوع داده در این رابطه محدود خواهیم کرد.<\/p><\/blockquote>\n<p>گوگل جزئیاتی در رابطه با اینکه چگونه سیاست\u200cهای جدید را پیاده می\u200cکند، ارائه نکرده است.<\/p>\n<p>شبکه\u200cی تبلیغاتی AdSense سرویسی است که با استفاده از آن تبلیغ\u200cکنندگان می\u200cتوانند پیام\u200cهای متنی تبلیغاتی خود را روی میلیون\u200cها سایتی که عضو این شبکه هستند، قرار دهند. این سرویس بخش بزرگی از درآمد تبلیغاتی برای وب\u200cسایت\u200cها را شامل می\u200cشود.<\/p>\n<p>ماه گذشته گزارشی منتشر شد که نشان از تولید و انتشار اخبار جعلی در رابطه با بدنام کردن <em><strong>هیلاری کلینتون<\/strong><\/em> توسط ناشرانی از کشور مقدونیه بود. این ناشران کوچک با انتشار اخبار جعلی و افزایش اشتراک\u200cگذاری این اخبار در شبکه\u200cهای اجتماعی، بازدیدکنندگان بسیاری را به سمت خود جلب می\u200cکردند که نتیجه\u200cای جز درآمدزایی از طریق افزایش ترافیک AdSense برای این وب\u200cسایت\u200cها نداشت.<\/p>\n<p>این اولین بار نیست که گوگل اقدام به محدود کردن دسترسی به سرویس تبلیغاتی خود می\u200cکند. این کمپانی نمایش تبلیغات در کنار تصاویر و ویدیوهای غیراخلاقی را بسیار پیش از این متوقف کرده است. گوگل برای اضافه کردن سایت\u200cها به شبکه\u200cی AdSense از ترکیب الگوریتم\u200cهای نرم\u200cافزاری در کنار انسان\u200cها استفاده می\u200cکند تا به\u200c بررسی داوطلبان اضافه شدن به این شبکه بپردازند. بر اساس اطلاعات ارائه\u200cشده؛ بازبینی سایت\u200cها پس از اضافه شدن در شبکه\u200cی AdSense نیز ادامه دارد. گوگل با آموزش هوش مصنوعی خود از طریق نمایش اطلاعات سایت\u200cهای حذف\u200cشده، فرآیند حذف سایت\u200cهایی با انتشار اخبار نادرست را سرعت خواهد بخشید.<\/p>\n<p>نمایش اخبار نادرست و جعلی در درآمدزایی خود گوگل نیز تأثیرگذار است، چرا که تبلیغ\u200cکنندگان به\u200cهیچ\u200cوجه دوست ندارند آگهی متنی آن\u200cها در کنار اخبار نادرست برای بازدیدکنندگان به نمایش گذاشته شود.<\/p>\n<p><em><strong>فیل منکزر<\/strong><\/em>، استاد دانشگاه ایندیانا اقدام گوگل بر<br />\nای قطع درآمدزایی سایت\u200cهای ناشر اخبار جعلی را بسیار مثبت خوانده است؛ هرچند از نظر وی تفکیک اخبار جعلی از واقعی کاری بس دشوار است و تنها به\u200cکارگیری نیروی انسانی برای انجام تفکیک کافی نیست و باید دانش لازم در این خصوص وجود داشته باشد.<\/p>\n<div class=\"beforesource\"><\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<div class=\"article-source-row\">\n<div><span class=\"label label-danger\">منبع<\/span> <a class=\"label label-default\" href=\"http://www.reuters.com/article/us-alphabet-advertising-idUSKBN1392MM\" target=\"_blank\" rel=\"nofollow\">REUTERS<\/a><\/div>\n<\/div>\n"}
     * excerpt : {"rendered":"<p>گوگل وفیسبوک به جنگ سایت های دروغین می روند با جلوگیری از نمایش تبلیغات آن &nbsp; گوگل و فیس\u200cبوک دیروز اعلام کردند که با تغییر استراتژی\u200cهای خود در پی قطع درآمدزایی وب\u200cسایت\u200cهایی هستند که از طریق انتشار اخبار جعلی اقدام به جلب نظر بینندگان و افزایش بازدیدکنندگان خود می\u200cکنند. این دو غول اینترنتی در نظر دارند با مسدود کردن استفاده از سرویس\u200cهای تبلیغاتی به این گونه وب\u200cسایت\u200cها، درآمد آن\u200cها را کاهش دهند&#8230;. <a class=\"moretag\" href=\"http://www.wiadevelopers.com/2016/11/16/7402/\"><span class=\"space\">&nbsp;&nbsp;<\/span>&nbsp;ادامه مطلب&nbsp;<\/a><\/p>\n"}
     * author : 1
     */

    private int id;
    private String date;
    private String link;
    private Title title;
    private Content content;
    private Excerpt excerpt;
    private int author;

    public int getId()
    {
        return id;
    }

    public void setId(int id)
    {
        this.id = id;
    }

    public String getDate()
    {
        return date;
    }

    public void setDate(String date)
    {
        this.date = date;
    }

    public String getLink()
    {
        return link;
    }

    public void setLink(String link)
    {
        this.link = link;
    }

    public Title getTitle()
    {
        return title;
    }

    public void setTitle(Title title)
    {
        this.title = title;
    }

    public Content getContent()
    {
        return content;
    }

    public void setContent(Content content)
    {
        this.content = content;
    }

    public Excerpt getExcerpt()
    {
        return excerpt;
    }

    public void setExcerpt(Excerpt excerpt)
    {
        this.excerpt = excerpt;
    }

    public int getAuthor()
    {
        return author;
    }

    public void setAuthor(int author)
    {
        this.author = author;
    }

    public String getAuthorName()
    {
        String authorName = "unKnow";
        if (author == 8)
            authorName = "فرزین نصیری";

        return authorName;
    }

    public String getAuthorAvatarUrl()
    {
        String avatarUrl = "noAvatar";
        if (author == 8)
            avatarUrl = "https://en.gravatar.com/userimage/171000148/7b092da4dafe7f27c985548c88f80ef8.png";

        return avatarUrl;
    }

    public static class Title
    {
        /**
         * rendered : گوگل وفیسبوک به جنگ سایت های دروغین می روند
         */

        private String rendered;

        public String getRendered()
        {
            return rendered;
        }

        public void setRendered(String rendered)
        {
            this.rendered = rendered;
        }

        public String toString()
        {
            rendered = rendered.replace("&#8211;"," - ");
            return rendered;
        }
    }

    public static class Content
    {
        /**
         * rendered : <div class="article-section">
         <p>گوگل وفیسبوک به جنگ سایت های دروغین می روند با جلوگیری از نمایش تبلیغات آن</p>
         <p>&nbsp;</p>
         <p>گوگل و فیس‌بوک دیروز اعلام کردند که با تغییر استراتژی‌های خود در پی قطع درآمدزایی وب‌سایت‌هایی هستند که از طریق انتشار اخبار جعلی اقدام به جلب نظر بینندگان و افزایش بازدیدکنندگان خود می‌کنند. این دو غول اینترنتی در نظر دارند با مسدود کردن استفاده از سرویس‌های تبلیغاتی به این گونه وب‌سایت‌ها، درآمد آن‌ها را کاهش دهند.</p>
         <p>&nbsp;</p>
         <p>گوگل اعلام کرده که سیاست‌های خود را به گونه‌ای تغییر می‌دهد تا وب‌سایت‌های منتشرکننده‌ی محتوای جعلی قادر به استفاده از سرویس تبلیغاتی AdSense این کمپانی نباشند. همچنین فیس‌بوک با به‌روزرسانی استراتژی‌های تبلیغاتی خود جلوی انتشار محتوای گمراه‌کننده را -که نتیجه‌ای جز همه‌گیر شدن اخبار جعلی ندارد- می‌گیرد.</p>
         <p>تغییرات اعمال‌شده در سیاست‌های گوگل و فیس‌بوک را باید تحت تأثیر اتهاماتی خواند که به این دو کمپانی (در کنار توییتر) برای عدم مدیریت اخبار جعلی وارد شده است. در جریان انتخابات ریاست جمهوری آمریکا که طی آن <em><strong>دونالد ترامپ</strong></em>، نامزد حذب جمهوری‌خواه به کاخ سفید رسید، هجمه‌ی اخبار جعلی و دروغین منتشرشده علیه این نامزد باعث شد تا طرفداران وی، شبکه‌های اجتماعی و گوگل را به دلیل عدم جلوگیری از نشر اطلاعات دروغین مورد انتقاد قرار دهند.<!--more--></p>
         <p>اتهامات واردشده واکنش‌های بسیاری از سوی این کمپانی‌ها برای شفاف‌سازی در مورد عدم جانب‌داری از کاندیداها در پی داشته است، به‌طوری‌که <em><strong>مارک زاکربرگ</strong></em>، مؤسس و مدیرعامل فیس‌بوک در روزهای اخیر دو بار به این نکته اشاره کرده که سرویس تحت امرش هیچ تأثیری در روند برگزاری انتخابات نداشته است.</p>
         <p>تغییراتی که فیس‌بوک اعمال می‌کند، محدود به سیاست‌های تبلیغاتی خود است و وب‌سایت‌هایی که اخبار آن‌ها در فیس‌بوک توسط کاربران منتشر می‌شود از این موضوع تأثیر نخواهند پذیرفت.</p>
         <p>تغییر استراتژی گوگل نیز در نمایش لینک‌های حاوی محتوای جعلی از قبیل اخبار در نتایج جستجو تأثیری نخواهد داشت. همچنین گوگل سیستمی برای رتبه‌بندی سایت‌ها بر اساس صلاحیت خبر در پیش نخواهد گرفت؛ بلکه در پی آن است تا درآمدزایی وب‌سایت‌ها از طریق انتشار اخبار نادرست و جعلی را که افزایش بازدید و افزایش درآمد تبلیغاتی در پی دارد، محدود کند. گوگل در این خصوص می‌گوید:</p>
         <blockquote><p>ما به‌مرور ارائه‌ی سرویس تبلیغاتی خود را به صفحاتی از وب که حاوی محتوای جعلی، گمراه‌کننده یا نادرست باشند، محدود کرده یا اطلاعات مربوط به ناشر، محتوای موردنظر  یا هر  نوع داده در این رابطه محدود خواهیم کرد.</p></blockquote>
         <p>گوگل جزئیاتی در رابطه با اینکه چگونه سیاست‌های جدید را پیاده می‌کند، ارائه نکرده است.</p>
         <p>شبکه‌ی تبلیغاتی AdSense سرویسی است که با استفاده از آن تبلیغ‌کنندگان می‌توانند پیام‌های متنی تبلیغاتی خود را روی میلیون‌ها سایتی که عضو این شبکه هستند، قرار دهند. این سرویس بخش بزرگی از درآمد تبلیغاتی برای وب‌سایت‌ها را شامل می‌شود.</p>
         <p>ماه گذشته گزارشی منتشر شد که نشان از تولید و انتشار اخبار جعلی در رابطه با بدنام کردن <em><strong>هیلاری کلینتون</strong></em> توسط ناشرانی از کشور مقدونیه بود. این ناشران کوچک با انتشار اخبار جعلی و افزایش اشتراک‌گذاری این اخبار در شبکه‌های اجتماعی، بازدیدکنندگان بسیاری را به سمت خود جلب می‌کردند که نتیجه‌ای جز درآمدزایی از طریق افزایش ترافیک AdSense برای این وب‌سایت‌ها نداشت.</p>
         <p>این اولین بار نیست که گوگل اقدام به محدود کردن دسترسی به سرویس تبلیغاتی خود می‌کند. این کمپانی نمایش تبلیغات در کنار تصاویر و ویدیوهای غیراخلاقی را بسیار پیش از این متوقف کرده است. گوگل برای اضافه کردن سایت‌ها به شبکه‌ی AdSense از ترکیب الگوریتم‌های نرم‌افزاری در کنار انسان‌ها استفاده می‌کند تا به‌ بررسی داوطلبان اضافه شدن به این شبکه بپردازند. بر اساس اطلاعات ارائه‌شده؛ بازبینی سایت‌ها پس از اضافه شدن در شبکه‌ی AdSense نیز ادامه دارد. گوگل با آموزش هوش مصنوعی خود از طریق نمایش اطلاعات سایت‌های حذف‌شده، فرآیند حذف سایت‌هایی با انتشار اخبار نادرست را سرعت خواهد بخشید.</p>
         <p>نمایش اخبار نادرست و جعلی در درآمدزایی خود گوگل نیز تأثیرگذار است، چرا که تبلیغ‌کنندگان به‌هیچ‌وجه دوست ندارند آگهی متنی آن‌ها در کنار اخبار نادرست برای بازدیدکنندگان به نمایش گذاشته شود.</p>
         <p><em><strong>فیل منکزر</strong></em>، استاد دانشگاه ایندیانا اقدام گوگل بر<br />
         ای قطع درآمدزایی سایت‌های ناشر اخبار جعلی را بسیار مثبت خوانده است؛ هرچند از نظر وی تفکیک اخبار جعلی از واقعی کاری بس دشوار است و تنها به‌کارگیری نیروی انسانی برای انجام تفکیک کافی نیست و باید دانش لازم در این خصوص وجود داشته باشد.</p>
         <div class="beforesource"></div>
         </div>
         <p>&nbsp;</p>
         <div class="article-source-row">
         <div><span class="label label-danger">منبع</span> <a class="label label-default" href="http://www.reuters.com/article/us-alphabet-advertising-idUSKBN1392MM" target="_blank" rel="nofollow">REUTERS</a></div>
         </div>

         */

        private String rendered;

        public String getRendered()
        {
            return rendered;
        }

        public void setRendered(String rendered)
        {
            this.rendered = rendered;
        }

        public String toString()
        {
            return rendered;
        }
    }

    public static class Excerpt
    {
        /**
         * rendered : <p>گوگل وفیسبوک به جنگ سایت های دروغین می روند با جلوگیری از نمایش تبلیغات آن &nbsp; گوگل و فیس‌بوک دیروز اعلام کردند که با تغییر استراتژی‌های خود در پی قطع درآمدزایی وب‌سایت‌هایی هستند که از طریق انتشار اخبار جعلی اقدام به جلب نظر بینندگان و افزایش بازدیدکنندگان خود می‌کنند. این دو غول اینترنتی در نظر دارند با مسدود کردن استفاده از سرویس‌های تبلیغاتی به این گونه وب‌سایت‌ها، درآمد آن‌ها را کاهش دهند&#8230;. <a class="moretag" href="http://www.wiadevelopers.com/2016/11/16/7402/"><span class="space">&nbsp;&nbsp;</span>&nbsp;ادامه مطلب&nbsp;</a></p>
         */

        private String rendered;

        public String getRendered()
        {
            return rendered;
        }

        public void setRendered(String rendered)
        {
            this.rendered = rendered;
        }

        public String toString()
        {
            rendered = rendered.replace("<span class=\"space\">&nbsp;&nbsp;</span>&nbsp;ادامه مطلب&nbsp;", "");
            return rendered;
        }
    }
}
